[{"iso3":"ESP","policy_non_nuclear_waste":"Near-surface disposal of VLLW and LLW at El Cabril.","policy_disused_sources":"Return to supplier or managed by ENRESA through storage and disposal routes.","policy_nfc_waste":"VLLW/LLW to El Cabril; higher-activity waste and SF to centralized storage then DGR.","policy_spent_fuel":"Interim storage for around 60 years before geological disposal.","wmo_name":"ENRESA","wmo_responsibilities":"All RW and SF management and decommissioning of nuclear facilities.","wmo_ownership":"State","funding_rwm":"Producers pay contributions through electricity tariffs and specific fees.","funding_sf_hlw":"Same national fund; contributions from nuclear operators.","funding_decom":"Decommissioning financed from the same fund.","reactors_in_operation":7,"reactors_under_construction":0,"reactors_decommissioning":1,"reactors_note":"Fleet of PWR and BWR units in operation; one reactor under decommissioning."},{"iso3":"GBR","policy_non_nuclear_waste":"LLW disposed at the national LLWR and Dounreay; VLLW may go to conventional landfills.","policy_disused_sources":"Return to supplier or managed through national waste routes.","policy_nfc_waste":"Higher activity waste to be disposed in a geological disposal facility; LLW via near-surface facilities.","policy_spent_fuel":"SF from AGR and PWR reactors expected to be disposed in a geological disposal facility after storage.","wmo_name":"Nuclear Decommissioning Authority (NDA)","wmo_responsibilities":"Strategic management of historic and public sector RW and SF liabilities.","wmo_ownership":"State","funding_rwm":"Government funding for NDA estate; producers pay for non-NDA sites.","funding_sf_hlw":"Combination of government funding and contributions from operators.","funding_decom":"Decommissioning funds for commercial reactors; government for legacy sites.","reactors_in_operation":9,"reactors_under_construction":2,"reactors_decommissioning":0,"reactors_note":"AGR fleet plus one PWR; two EPR units under construction at Hinkley Point C."},{"iso3":"SWE","policy_non_nuclear_waste":"Institutional waste and LLW disposed in near-surface facilities where appropriate.","policy_disused_sources":"Return to supplier if feasible, otherwise storage and disposal in national facilities.","policy_nfc_waste":"Existing LLW repository and planned facilities for long-lived ILW and geological disposal.","policy_spent_fuel":"Direct disposal of spent fuel in a deep geological repository at Forsmark (KBS-3).","wmo_name":"SKB","wmo_responsibilities":"Development and operation of SF and RW storage and disposal facilities.","wmo_ownership":"Nuclear utilities","funding_rwm":"Nuclear Waste Fund financed by fees on nuclear electricity generation.","funding_sf_hlw":"Same Nuclear Waste Fund for SF/HLW.","funding_decom":"Decommissioning costs covered via the same fund.","reactors_in_operation":6,"reactors_under_construction":0,"reactors_decommissioning":0,"reactors_note":"Six reactors in operation at Forsmark, Oskarshamn and Ringhals."},{"iso3":"TUR","policy_non_nuclear_waste":"Near-surface storage/disposal for institutional radioactive waste.","policy_disused_sources":"Return to supplier where possible, otherwise centralized storage and conditioning.","policy_nfc_waste":"Centralized storage at NPP site and future disposal facility.","policy_spent_fuel":"Long-term storage of spent fuel at Akkuyu NPP site; geological disposal option under development.","wmo_name":"TENMAK","wmo_responsibilities":"National coordination of radioactive waste management and disposal projects.","wmo_ownership":"State","funding_rwm":"Producers pay contributions to a radioactive waste management account.","funding_sf_hlw":"Fees on nuclear electricity to a spent fuel and HLW fund.","funding_decom":"Separate decommissioning fund financed by operators.","reactors_in_operation":0,"reactors_under_construction":4,"reactors_decommissioning":0,"reactors_note":"Four VVER-1200 units under construction at Akkuyu NPP."},{"iso3":"USA","policy_non_nuclear_waste":"LLW disposed in regional near-surface facilities; ILW disposal routes vary by state/compact.","policy_disused_sources":"Return to manufacturer where possible; otherwise storage, reuse, recycle or disposal.","policy_nfc_waste":"LLW via near-surface disposal; HLW intended for disposal in a geological repository.","policy_spent_fuel":"Wet and dry storage at reactor sites and ISFSIs with long-term geological disposal as policy.","wmo_name":"US Department of Energy (DOE)","wmo_responsibilities":"Management of DOE-owned RW and SF and development of federal disposal solutions; LLW for commercial waste via state/compact system.","wmo_ownership":"State / federal agencies and state compacts","funding_rwm":"Producers and government funding depending on waste origin.","funding_sf_hlw":"Nuclear Waste Fund financed by fees on nuclear electricity (collections suspended).","funding_decom":"Decommissioning trust funds regulated by NRC; public sector sites funded by the federal budget.","reactors_in_operation":93,"reactors_under_construction":0,"reactors_decommissioning":20,"reactors_note":"Large LWR fleet with many units permanently shut down and in various stages of decommissioning."}]