[
  {
    "iso3": "ESP",
    "policy_non_nuclear_waste": "Near-surface disposal of VLLW and LLW at El Cabril.",
    "policy_disused_sources": "Return to supplier or managed by ENRESA through storage and disposal routes.",
    "policy_nfc_waste": "VLLW/LLW to El Cabril; higher-activity waste and SF to centralized storage then DGR.",
    "policy_spent_fuel": "Interim storage for around 60 years before geological disposal.",
    "wmo_name": "ENRESA",
    "wmo_responsibilities": "All RW and SF management and decommissioning of nuclear facilities.",
    "wmo_ownership": "State",
    "funding_rwm": "Producers pay contributions through electricity tariffs and specific fees.",
    "funding_sf_hlw": "Same national fund; contributions from nuclear operators.",
    "funding_decom": "Decommissioning financed from the same fund.",
    "reactors_in_operation": 7,
    "reactors_under_construction": 0,
    "reactors_decommissioning": 1,
    "reactors_note": "Fleet of PWR and BWR units in operation; one reactor under decommissioning."
  },
  {
    "iso3": "GBR",
    "policy_non_nuclear_waste": "LLW disposed at the national LLWR and Dounreay; VLLW may go to conventional landfills.",
    "policy_disused_sources": "Return to supplier or managed through national waste routes.",
    "policy_nfc_waste": "Higher activity waste to be disposed in a geological disposal facility; LLW via near-surface facilities.",
    "policy_spent_fuel": "SF from AGR and PWR reactors expected to be disposed in a geological disposal facility after storage.",
    "wmo_name": "Nuclear Decommissioning Authority (NDA)",
    "wmo_responsibilities": "Strategic management of historic and public sector RW and SF liabilities.",
    "wmo_ownership": "State",
    "funding_rwm": "Government funding for NDA estate; producers pay for non-NDA sites.",
    "funding_sf_hlw": "Combination of government funding and contributions from operators.",
    "funding_decom": "Decommissioning funds for commercial reactors; government for legacy sites.",
    "reactors_in_operation": 9,
    "reactors_under_construction": 2,
    "reactors_decommissioning": 0,
    "reactors_note": "AGR fleet plus one PWR; two EPR units under construction at Hinkley Point C."
  },
  {
    "iso3": "SWE",
    "policy_non_nuclear_waste": "Institutional waste and LLW disposed in near-surface facilities where appropriate.",
    "policy_disused_sources": "Return to supplier if feasible, otherwise storage and disposal in national facilities.",
    "policy_nfc_waste": "Existing LLW repository and planned facilities for long-lived ILW and geological disposal.",
    "policy_spent_fuel": "Direct disposal of spent fuel in a deep geological repository at Forsmark (KBS-3).",
    "wmo_name": "SKB",
    "wmo_responsibilities": "Development and operation of SF and RW storage and disposal facilities.",
    "wmo_ownership": "Nuclear utilities",
    "funding_rwm": "Nuclear Waste Fund financed by fees on nuclear electricity generation.",
    "funding_sf_hlw": "Same Nuclear Waste Fund for SF/HLW.",
    "funding_decom": "Decommissioning costs covered via the same fund.",
    "reactors_in_operation": 6,
    "reactors_under_construction": 0,
    "reactors_decommissioning": 0,
    "reactors_note": "Six reactors in operation at Forsmark, Oskarshamn and Ringhals."
  },
  {
    "iso3": "TUR",
    "policy_non_nuclear_waste": "Near-surface storage/disposal for institutional radioactive waste.",
    "policy_disused_sources": "Return to supplier where possible, otherwise centralized storage and conditioning.",
    "policy_nfc_waste": "Centralized storage at NPP site and future disposal facility.",
    "policy_spent_fuel": "Long-term storage of spent fuel at Akkuyu NPP site; geological disposal option under development.",
    "wmo_name": "TENMAK",
    "wmo_responsibilities": "National coordination of radioactive waste management and disposal projects.",
    "wmo_ownership": "State",
    "funding_rwm": "Producers pay contributions to a radioactive waste management account.",
    "funding_sf_hlw": "Fees on nuclear electricity to a spent fuel and HLW fund.",
    "funding_decom": "Separate decommissioning fund financed by operators.",
    "reactors_in_operation": 0,
    "reactors_under_construction": 4,
    "reactors_decommissioning": 0,
    "reactors_note": "Four VVER-1200 units under construction at Akkuyu NPP."
  },
  {
    "iso3": "USA",
    "policy_non_nuclear_waste": "LLW disposed in regional near-surface facilities; ILW disposal routes vary by state/compact.",
    "policy_disused_sources": "Return to manufacturer where possible; otherwise storage, reuse, recycle or disposal.",
    "policy_nfc_waste": "LLW via near-surface disposal; HLW intended for disposal in a geological repository.",
    "policy_spent_fuel": "Wet and dry storage at reactor sites and ISFSIs with long-term geological disposal as policy.",
    "wmo_name": "US Department of Energy (DOE)",
    "wmo_responsibilities": "Management of DOE-owned RW and SF and development of federal disposal solutions; LLW for commercial waste via state/compact system.",
    "wmo_ownership": "State / federal agencies and state compacts",
    "funding_rwm": "Producers and government funding depending on waste origin.",
    "funding_sf_hlw": "Nuclear Waste Fund financed by fees on nuclear electricity (collections suspended).",
    "funding_decom": "Decommissioning trust funds regulated by NRC; public sector sites funded by the federal budget.",
    "reactors_in_operation": 93,
    "reactors_under_construction": 0,
    "reactors_decommissioning": 20,
    "reactors_note": "Large LWR fleet with many units permanently shut down and in various stages of decommissioning."
  },
  {
    "iso3": "FIN",
    "policy_non_nuclear_waste": "Low- and intermediate-level waste disposed in underground rock caverns at Olkiluoto and Loviisa sites.",
    "policy_disused_sources": "Disused sources returned to supplier or managed by national waste facilities.",
    "policy_nfc_waste": "Operational waste to VLJ and Loviisa repositories; long-lived ILW and HLW to deep geological repository.",
    "policy_spent_fuel": "Spent fuel stored at plant-specific interim facilities before final disposal in the Onkalo repository.",
    "wmo_name": "Posiva Oy & Fortum/TVO",
    "wmo_responsibilities": "Posiva responsible for spent fuel disposal; utilities responsible for operational waste management.",
    "wmo_ownership": "Private utilities under state oversight",
    "funding_rwm": "Nuclear Waste Fund financed by levies on nuclear electricity and producers.",
    "funding_sf_hlw": "Same fund for spent fuel and HLW management.",
    "funding_decom": "Decommissioning financed through the Nuclear Waste Fund.",
    "reactors_in_operation": 5,
    "reactors_under_construction": 0,
    "reactors_decommissioning": 0,
    "reactors_note": "Five reactors in operation (Loviisa 1–2, Olkiluoto 1–3); one EPR commenced commercial operation in 2023."
  },
  {
    "iso3": "FRA",
    "policy_non_nuclear_waste": "Very low-level waste disposed at Cires; low- and intermediate-level short-lived waste at CSA repository.",
    "policy_disused_sources": "Disused sealed sources returned to supplier or managed by Andra.",
    "policy_nfc_waste": "VLLW/LLW to surface repositories; long-lived ILW and vitrified HLW stored at La Hague pending deep geological disposal (CIGEO).",
    "policy_spent_fuel": "Spent fuel largely reprocessed at La Hague; remaining waste stored before geological disposal.",
    "wmo_name": "Andra",
    "wmo_responsibilities": "Planning, construction and operation of radioactive waste disposal facilities in France.",
    "wmo_ownership": "State-owned agency",
    "funding_rwm": "Financed by generators via contributions and dedicated provisions.",
    "funding_sf_hlw": "Same national funds and contracts with EDF/Orano for HLW.",
    "funding_decom": "Decommissioning and waste management financed by operators under state oversight.",
    "reactors_in_operation": 56,
    "reactors_under_construction": 1,
    "reactors_decommissioning": 14,
    "reactors_note": "Large PWR fleet; one EPR under construction; several older units in decommissioning."
  },
  {
    "iso3": "DEU",
    "policy_non_nuclear_waste": "Conditioned LLW/ILW to be disposed in the Konrad mine; near-surface storage at nuclear sites.",
    "policy_disused_sources": "Disused sources managed by state collection points or returned to supplier.",
    "policy_nfc_waste": "Operational waste to central interim storage; long-lived waste and spent fuel to future geological repository.",
    "policy_spent_fuel": "Spent fuel stored in dry casks at reactor sites; final disposal to a deep geological repository (site selection ongoing).",
    "wmo_name": "Bundesgesellschaft für Endlagerung (BGE)",
    "wmo_responsibilities": "Development and operation of radioactive waste repositories (Konrad, future HLW repository).",
    "wmo_ownership": "State-owned company",
    "funding_rwm": "Funded by waste producers (utilities) and a state-administered fund created with utility contributions.",
    "funding_sf_hlw": "Same fund covers spent fuel and HLW management.",
    "funding_decom": "Decommissioning financed by operators; oversight by state agencies.",
    "reactors_in_operation": 0,
    "reactors_under_construction": 0,
    "reactors_decommissioning": 6,
    "reactors_note": "All power reactors shut down in 2023 as part of the nuclear phase-out; several reactors in decommissioning."
  },
  {
    "iso3": "RUS",
    "policy_non_nuclear_waste": "LLW and ILW are processed and disposed in engineered near-surface facilities; some waste injected into deep boreholes.",
    "policy_disused_sources": "Disused sealed sources returned to supplier or managed by licensed facilities.",
    "policy_nfc_waste": "Operational waste reprocessed or conditioned and stored; HLW vitrified and stored pending final disposal.",
    "policy_spent_fuel": "Spent fuel reprocessed at Mayak; some stored for possible recycling; deep geological repository planned at Krasnoyarsk.",
    "wmo_name": "NO RAO",
    "wmo_responsibilities": "Management and disposal of radioactive waste in Russia, including repository development.",
    "wmo_ownership": "State corporation under Rosatom",
    "funding_rwm": "Financed by waste generators through levies; state funding for legacy waste.",
    "funding_sf_hlw": "Same mechanisms for spent fuel and HLW, with contributions from nuclear operators.",
    "funding_decom": "Decommissioning financed by state and operators via dedicated funds.",
    "reactors_in_operation": 38,
    "reactors_under_construction": 2,
    "reactors_decommissioning": 9,
    "reactors_note": "Large fleet of VVER, RBMK and fast reactors in operation; several reactors under construction and older units being decommissioned."
  },
  {
    "iso3": "CHN",
    "policy_non_nuclear_waste": "Low- and intermediate-level waste disposed in regional engineered surface repositories (Northwest, Southwest sites).",
    "policy_disused_sources": "Disused sources collected and managed by provincial waste agencies or returned to supplier.",
    "policy_nfc_waste": "Operational waste conditioned and disposed; HLW vitrified and stored; deep geological repository planned near Beishan.",
    "policy_spent_fuel": "Spent fuel stored at reactor sites and at centralized interim facilities; long-term plan for reprocessing and geological disposal.",
    "wmo_name": "China National Nuclear Corporation (CNNC)",
    "wmo_responsibilities": "Responsible for nuclear fuel cycle including waste treatment and disposal; CNNC Nuclear Environment Company for waste.",
    "wmo_ownership": "State-owned enterprise",
    "funding_rwm": "Financed by state and contributions from nuclear operators via waste disposal fees.",
    "funding_sf_hlw": "Same funding mechanisms for spent fuel and HLW management.",
    "funding_decom": "Decommissioning costs covered by operators with state oversight.",
    "reactors_in_operation": 55,
    "reactors_under_construction": 22,
    "reactors_decommissioning": 0,
    "reactors_note": "Rapidly expanding fleet dominated by PWRs; numerous units under construction at coastal sites."
  },
  {
    "iso3": "IND",
    "policy_non_nuclear_waste": "Low- and intermediate-level waste is processed and stored at each site; some near-surface disposal.",
    "policy_disused_sources": "Disused sources returned to supplier or managed by the Atomic Energy Regulatory Board.",
    "policy_nfc_waste": "Operational waste conditioned and stored; vitrified HLW stored at Tarapur; deep geological repository under study.",
    "policy_spent_fuel": "Spent fuel is reprocessed (PHWRs) or stored; long-term disposal being planned.",
    "wmo_name": "BARC & NPCIL",
    "wmo_responsibilities": "BARC handles fuel cycle and waste management R&D; NPCIL manages operational waste from NPPs.",
    "wmo_ownership": "State-owned",
    "funding_rwm": "Financed through electricity tariffs and government funding.",
    "funding_sf_hlw": "Same funding sources for spent fuel and HLW management.",
    "funding_decom": "Decommissioning costs covered by state and operators via provisions.",
    "reactors_in_operation": 22,
    "reactors_under_construction": 8,
    "reactors_decommissioning": 0,
    "reactors_note": "A mix of PHWRs and two VVER units; several PHWR units under construction."
  },
  {
    "iso3": "JPN",
    "policy_non_nuclear_waste": "Very low-level waste to disposal at Rokkasho; LLW to engineered trenches and future repository.",
    "policy_disused_sources": "Disused sources returned to manufacturer or managed by JAEA facilities.",
    "policy_nfc_waste": "Operational waste conditioned and disposed; vitrified HLW stored at Rokkasho awaiting geological disposal.",
    "policy_spent_fuel": "Spent fuel stored at plant pools and at Mutsu; long-term plan for direct disposal in a geological repository.",
    "wmo_name": "NUMO & JNFL",
    "wmo_responsibilities": "NUMO responsible for siting and construction of geological repository; JNFL for LLW disposal and reprocessing.",
    "wmo_ownership": "Jointly owned by utilities and state",
    "funding_rwm": "Financed by waste generators via fees; reprocessing and disposal funds managed by the Radioactive Waste Management Fund.",
    "funding_sf_hlw": "Same fund supports HLW management and geological disposal.",
    "funding_decom": "Decommissioning financed through decommissioning funds collected from operators.",
    "reactors_in_operation": 10,
    "reactors_under_construction": 0,
    "reactors_decommissioning": 17,
    "reactors_note": "Post-Fukushima restart of selected BWR and PWR units; many reactors in long-term shutdown or decommissioning."
  },
  {
    "iso3": "CAN",
    "policy_non_nuclear_waste": "Low- and intermediate-level waste to near-surface disposal at Chalk River and licensed sites.",
    "policy_disused_sources": "Disused sources returned to manufacturer or managed by CNL.",
    "policy_nfc_waste": "Operational waste conditioned and stored; LLW and ILW disposal facilities planned; HLW stored until repository available.",
    "policy_spent_fuel": "Spent fuel stored at reactor sites in pools and dry storage; long-term deep geological repository being sited by NWMO.",
    "wmo_name": "NWMO & CNL",
    "wmo_responsibilities": "NWMO manages planning for deep geological disposal of spent fuel; CNL manages low- and intermediate-level waste and legacy sites.",
    "wmo_ownership": "Non-profit (NWMO) owned by nuclear utilities; CNL is a federal contractor",
    "funding_rwm": "Financed by nuclear operators via the Nuclear Fuel Waste Act funds and government for legacy waste.",
    "funding_sf_hlw": "Spent fuel management financed by trust funds contributed by operators.",
    "funding_decom": "Decommissioning financed by operators through trust funds and by government for federally owned facilities.",
    "reactors_in_operation": 19,
    "reactors_under_construction": 0,
    "reactors_decommissioning": 6,
    "reactors_note": "Major CANDU fleet in Ontario; some units permanently shut down and decommissioned."
  },
  {
    "iso3": "BEL",
    "policy_non_nuclear_waste": "Low-level and very low-level waste disposed in surface repository at Dessel (cAt project).",
    "policy_disused_sources": "Disused sources returned to supplier or collected and stored by ONDRAF/NIRAS.",
    "policy_nfc_waste": "Operational waste conditioned and stored at Belgoprocess; long-lived ILW and HLW stored awaiting deep repository.",
    "policy_spent_fuel": "Spent fuel stored in pools at reactor sites; decision on reprocessing vs direct disposal pending.",
    "wmo_name": "ONDRAF/NIRAS",
    "wmo_responsibilities": "Management of all radioactive waste in Belgium, including disposal facility development.",
    "wmo_ownership": "State agency",
    "funding_rwm": "Financed by waste producers via levies and a national waste fund.",
    "funding_sf_hlw": "Same fund for spent fuel and HLW management.",
    "funding_decom": "Decommissioning financed through provisions by operators and national fund.",
    "reactors_in_operation": 5,
    "reactors_under_construction": 0,
    "reactors_decommissioning": 2,
    "reactors_note": "PWR fleet at Doel and Tihange; phase-out policy under debate."
  },
  {
    "iso3": "NLD",
    "policy_non_nuclear_waste": "All radioactive waste stored at COVRA; no disposal facility yet.",
    "policy_disused_sources": "Disused sources returned to supplier or collected by COVRA.",
    "policy_nfc_waste": "Operational waste conditioned and stored at COVRA; disposal policy under development.",
    "policy_spent_fuel": "Spent fuel from Borssele returned to France after reprocessing; HLW stored at COVRA pending geological disposal.",
    "wmo_name": "COVRA",
    "wmo_responsibilities": "Central organization for the management, treatment and storage of all radioactive waste in the Netherlands.",
    "wmo_ownership": "State-owned company",
    "funding_rwm": "Financed by waste producers via fees.",
    "funding_sf_hlw": "Same fee structure funds management of spent fuel and HLW.",
    "funding_decom": "Decommissioning financed by operators through dedicated funds.",
    "reactors_in_operation": 1,
    "reactors_under_construction": 0,
    "reactors_decommissioning": 0,
    "reactors_note": "One PWR at Borssele in operation; lifetime extended."
  },
  {
    "iso3": "CHE",
    "policy_non_nuclear_waste": "Short-lived LLW/ILW disposed in the Würenlingen repository at ZWILAG; VLLW recycled where possible.",
    "policy_disused_sources": "Disused sources returned to supplier or managed by PSI/ZWILAG.",
    "policy_nfc_waste": "Operational waste conditioned and stored; deep geological repository planned for HLW and long-lived ILW.",
    "policy_spent_fuel": "Spent fuel stored in pools and at ZWILAG interim facility; direct disposal planned in Nördlich Lägern repository.",
    "wmo_name": "NAGRA",
    "wmo_responsibilities": "Responsible for siting, construction and operation of deep geological repository and long-term management of HLW/ILW.",
    "wmo_ownership": "Co-operative owned by nuclear utilities and federal government",
    "funding_rwm": "Financed by nuclear utilities through dedicated funds; government contributes for research and oversight.",
    "funding_sf_hlw": "Same funding arrangements for HLW and spent fuel management.",
    "funding_decom": "Decommissioning financed by operators through funds supervised by federal authority.",
    "reactors_in_operation": 4,
    "reactors_under_construction": 0,
    "reactors_decommissioning": 0,
    "reactors_note": "Four reactors (Beznau 1-2, Gösgen, Leibstadt); Mühleberg shut down in 2019."
  },
  {
    "iso3": "ZAF",
    "policy_non_nuclear_waste": "Low- and intermediate-level waste disposed at Vaalputs repository.",
    "policy_disused_sources": "Disused sources returned to supplier or managed by NRWDI.",
    "policy_nfc_waste": "Operational waste conditioned and disposed at Vaalputs; HLW stored at Koeberg pending repository development.",
    "policy_spent_fuel": "Spent fuel stored at Koeberg in pools and dry casks; long-term plan for geological disposal.",
    "wmo_name": "NRWDI",
    "wmo_responsibilities": "Development and operation of radioactive waste disposal facilities in South Africa.",
    "wmo_ownership": "State-owned",
    "funding_rwm": "Financed by levies on nuclear electricity and government funding.",
    "funding_sf_hlw": "Same funding framework for spent fuel and HLW.",
    "funding_decom": "Decommissioning funded by provisions by Eskom and government oversight.",
    "reactors_in_operation": 2,
    "reactors_under_construction": 0,
    "reactors_decommissioning": 0,
    "reactors_note": "Two PWR units at Koeberg; plans for new build deferred."
  },
  {
    "iso3": "ARG",
    "policy_non_nuclear_waste": "Low- and intermediate-level waste stored and partially disposed at the Ezeiza facility.",
    "policy_disused_sources": "Disused sealed sources returned to supplier or managed by CNEA.",
    "policy_nfc_waste": "Operational waste conditioned and stored at Ezeiza; LLW/ILW to near-surface repositories under development.",
    "policy_spent_fuel": "Spent fuel stored at each plant; some dry storage at Embalse; long-term plan for geological disposal or return to supplier.",
    "wmo_name": "CNEA",
    "wmo_responsibilities": "Responsible for radioactive waste management and decommissioning activities in Argentina.",
    "wmo_ownership": "State-owned",
    "funding_rwm": "Financed by levies on nuclear electricity and government budget.",
    "funding_sf_hlw": "Same fund covers spent fuel and HLW management.",
    "funding_decom": "Decommissioning financed via CNEA funds and operator contributions.",
    "reactors_in_operation": 3,
    "reactors_under_construction": 1,
    "reactors_decommissioning": 0,
    "reactors_note": "Three reactors in operation (Atucha 1–2, Embalse); one SMR under construction."
  },
  {
    "iso3": "ARM",
    "policy_non_nuclear_waste": "LLW stored on-site at the Armenian NPP; no disposal facility yet.",
    "policy_disused_sources": "Disused sources returned to supplier or managed by national authority.",
    "policy_nfc_waste": "Operational waste conditioned and stored at plant; disposal policy under development.",
    "policy_spent_fuel": "Spent fuel stored in pools; Russia responsible for taking back fuel for reprocessing under fuel supply contracts.",
    "wmo_name": "ANRA/ANPP",
    "wmo_responsibilities": "Regulator oversees waste management; plant operator manages waste and storage.",
    "wmo_ownership": "State",
    "funding_rwm": "Costs recovered through electricity tariffs and state support.",
    "funding_sf_hlw": "Spent fuel management funded through contracts with fuel supplier (Russia).",
    "funding_decom": "Decommissioning funding mechanism under development.",
    "reactors_in_operation": 1,
    "reactors_under_construction": 0,
    "reactors_decommissioning": 0,
    "reactors_note": "One VVER-440 unit at Metsamor; life extension approved."
  },
  {
    "iso3": "BLR",
    "policy_non_nuclear_waste": "LLW and ILW stored on-site; future near-surface disposal planned.",
    "policy_disused_sources": "Disused sources returned to supplier or stored by national waste management organization.",
    "policy_nfc_waste": "Operational waste conditioned and stored at plant site; final disposal facility planned.",
    "policy_spent_fuel": "Spent fuel returned to Russia under fuel supply contract; no national disposal foreseen.",
    "wmo_name": "Gosatomnadzor/Belarusian NPP",
    "wmo_responsibilities": "Regulator oversees waste management; plant operator responsible for waste handling.",
    "wmo_ownership": "State",
    "funding_rwm": "Financed through electricity tariffs and agreements with Russian fuel supplier.",
    "funding_sf_hlw": "Same arrangement covers spent fuel returned to Russia.",
    "funding_decom": "Decommissioning costs to be funded by future provisions.",
    "reactors_in_operation": 1,
    "reactors_under_construction": 1,
    "reactors_decommissioning": 0,
    "reactors_note": "Belarusian NPP with one unit operating and one under construction."
  },
  {
    "iso3": "BGD",
    "policy_non_nuclear_waste": "LLW from research facilities stored at AERE Savar; disposal site to be developed.",
    "policy_disused_sources": "Disused sources returned to supplier or stored by BAERA.",
    "policy_nfc_waste": "Operational waste from Rooppur NPP to be managed by plant operator; policies under development.",
    "policy_spent_fuel": "Spent fuel from Rooppur to be returned to Russia for reprocessing under intergovernmental agreement.",
    "wmo_name": "BAEC",
    "wmo_responsibilities": "Manages nuclear research and will oversee waste management for Rooppur NPP.",
    "wmo_ownership": "State",
    "funding_rwm": "Financed by state budget and provisions from nuclear project.",
    "funding_sf_hlw": "Spent fuel and HLW funding through contract with Russian supplier.",
    "funding_decom": "Decommissioning financing framework to be established.",
    "reactors_in_operation": 0,
    "reactors_under_construction": 2,
    "reactors_decommissioning": 0,
    "reactors_note": "Two VVER-1200 units under construction at Rooppur; no reactors operating yet."
  },
  {
    "iso3": "BRA",
    "policy_non_nuclear_waste": "LLW and ILW disposed at near-surface repository (Abadia de Goiás); more facilities planned.",
    "policy_disused_sources": "Disused sources returned to supplier or managed by CNEN.",
    "policy_nfc_waste": "Operational waste conditioned and stored; national repository (RBMN) for LLW/ILW planned in Caetité.",
    "policy_spent_fuel": "Spent fuel stored at Angra site; long-term plan for deep geological disposal by 2050.",
    "wmo_name": "CNEN",
    "wmo_responsibilities": "Regulates and manages radioactive waste; Eletronuclear responsible for waste from power plants.",
    "wmo_ownership": "State",
    "funding_rwm": "Financed by electricity tariffs and government funding.",
    "funding_sf_hlw": "Same scheme funds spent fuel and HLW management.",
    "funding_decom": "Decommissioning funded through provisions by Eletronuclear and government support.",
    "reactors_in_operation": 2,
    "reactors_under_construction": 1,
    "reactors_decommissioning": 0,
    "reactors_note": "Two PWR units at Angra in operation; Angra 3 construction resumed intermittently."
  },
  {
    "iso3": "CZE",
    "policy_non_nuclear_waste": "LLW and ILW disposed in near-surface repository at Dukovany.",
    "policy_disused_sources": "Disused sources returned to supplier or managed by SURAO.",
    "policy_nfc_waste": "Operational waste conditioned and disposed; long-lived ILW and HLW to be disposed in deep geological repository by 2065.",
    "policy_spent_fuel": "Spent fuel stored in interim dry casks at Dukovany and Temelín; final disposal in planned repository.",
    "wmo_name": "SURAO",
    "wmo_responsibilities": "Responsible for safe disposal of all radioactive waste and for developing a deep geological repository.",
    "wmo_ownership": "State",
    "funding_rwm": "Financed by levies on nuclear electricity and contributions from waste producers.",
    "funding_sf_hlw": "Same fund for spent fuel and HLW management.",
    "funding_decom": "Decommissioning financed by operators through provisions.",
    "reactors_in_operation": 6,
    "reactors_under_construction": 0,
    "reactors_decommissioning": 0,
    "reactors_note": "Six PWR units in operation; plans for a new unit at Dukovany."
  },
  {
    "iso3": "SVK",
    "policy_non_nuclear_waste": "LLW and ILW disposed in National Radioactive Waste Repository at Mochovce.",
    "policy_disused_sources": "Disused sources returned to supplier or managed by JAVYS.",
    "policy_nfc_waste": "Operational waste conditioned and disposed; long-lived ILW and HLW to be disposed in deep geological repository.",
    "policy_spent_fuel": "Spent fuel stored at Bohunice and Mochovce interim storage facilities; final disposal planned in geological repository.",
    "wmo_name": "JAVYS",
    "wmo_responsibilities": "Responsible for decommissioning and waste management, including disposal facility operation.",
    "wmo_ownership": "State-owned",
    "funding_rwm": "Financed by National Nuclear Fund through electricity tariffs.",
    "funding_sf_hlw": "Same fund supports spent fuel and HLW management.",
    "funding_decom": "Decommissioning financed through National Nuclear Fund.",
    "reactors_in_operation": 4,
    "reactors_under_construction": 2,
    "reactors_decommissioning": 2,
    "reactors_note": "Four reactors in operation; Mochovce 3–4 nearing completion; Bohunice V1 units in decommissioning."
  },
  {
    "iso3": "SVN",
    "policy_non_nuclear_waste": "LLW and ILW planned for disposal at Vrbina repository (under construction).",
    "policy_disused_sources": "Disused sources returned to supplier or managed by ARAO.",
    "policy_nfc_waste": "Operational waste conditioned and stored at Krško; repository planned for operational waste.",
    "policy_spent_fuel": "Spent fuel stored at Krško in pools and a dry storage facility; joint disposal solution with Croatia under negotiation.",
    "wmo_name": "ARAO",
    "wmo_responsibilities": "Management of radioactive waste and siting of LILW repository.",
    "wmo_ownership": "State",
    "funding_rwm": "Financed by contributions from the Krško NPP owners (Slovenia and Croatia).",
    "funding_sf_hlw": "Same contributions and national fund for spent fuel and HLW.",
    "funding_decom": "Decommissioning financed by owners’ decommissioning fund.",
    "reactors_in_operation": 1,
    "reactors_under_construction": 0,
    "reactors_decommissioning": 0,
    "reactors_note": "Krško PWR operated jointly by Slovenia and Croatia; long-term operation to 2043."
  },
  {
    "iso3": "ROU",
    "policy_non_nuclear_waste": "LLW and ILW disposed at Saligny repository near Cernavodă.",
    "policy_disused_sources": "Disused sources returned to supplier or stored at IFIN-HH.",
    "policy_nfc_waste": "Operational waste conditioned and stored; long-lived ILW and HLW to be disposed in a future deep repository.",
    "policy_spent_fuel": "Spent fuel from Cernavodă stored in dry storage modules on site; final disposal planned in geological repository.",
    "wmo_name": "ANDR",
    "wmo_responsibilities": "Responsible for management and final disposal of radioactive waste in Romania.",
    "wmo_ownership": "State",
    "funding_rwm": "Financed by levies on nuclear electricity and state budget.",
    "funding_sf_hlw": "Same financing for spent fuel and HLW management.",
    "funding_decom": "Decommissioning financed by operator provisions and national fund.",
    "reactors_in_operation": 2,
    "reactors_under_construction": 1,
    "reactors_decommissioning": 0,
    "reactors_note": "Two CANDU units at Cernavodă in operation; two additional units planned."
  },
  {
    "iso3": "UKR",
    "policy_non_nuclear_waste": "LLW and ILW disposed at near-surface repositories in the Chernobyl exclusion zone and at Vektor complex.",
    "policy_disused_sources": "Disused sources returned to supplier or managed by national waste company.",
    "policy_nfc_waste": "Operational waste conditioned and stored; long-lived ILW and HLW to be disposed in future deep repository.",
    "policy_spent_fuel": "Spent fuel stored on-site at NPPs and at centralized interim storage facility (CISF); eventual geological disposal planned.",
    "wmo_name": "State Agency of Ukraine on Exclusion Zone Management & Energoatom",
    "wmo_responsibilities": "Management of radioactive waste and spent fuel; development of disposal facilities.",
    "wmo_ownership": "State",
    "funding_rwm": "Financed by electricity tariffs and government funding.",
    "funding_sf_hlw": "Same funding covers spent fuel and HLW management.",
    "funding_decom": "Decommissioning financed via state budget and contributions from Energoatom.",
    "reactors_in_operation": 15,
    "reactors_under_construction": 4,
    "reactors_decommissioning": 0,
    "reactors_note": "Four NPP sites with VVER units; construction of two units at Khmelnytskyi resumed; war impacts operations."
  },
  {
    "iso3": "LTU",
    "policy_non_nuclear_waste": "LLW and ILW disposed at Maišiagala and Ignalina repositories; new repository under development.",
    "policy_disused_sources": "Disused sources returned to supplier or collected by state enterprise.",
    "policy_nfc_waste": "Operational waste from Ignalina decommissioning conditioned and stored; long-term repository being developed.",
    "policy_spent_fuel": "Spent fuel from Ignalina stored in dry storage at the site; direct disposal planned.",
    "wmo_name": "RATA",
    "wmo_responsibilities": "Management of decommissioning waste and development of final disposal solutions.",
    "wmo_ownership": "State",
    "funding_rwm": "Financed by EU funds and national budget.",
    "funding_sf_hlw": "Same funding for spent fuel and HLW management.",
    "funding_decom": "Decommissioning funded through international and national funds.",
    "reactors_in_operation": 0,
    "reactors_under_construction": 0,
    "reactors_decommissioning": 2,
    "reactors_note": "Ignalina RBMK reactors shut down (2004/2009) and being decommissioned."
  },
  {
    "iso3": "KAZ",
    "policy_non_nuclear_waste": "LLW and ILW from research reactors and uranium industry disposed at near-surface facilities.",
    "policy_disused_sources": "Disused sources returned to supplier or managed by National Nuclear Center.",
    "policy_nfc_waste": "Operational waste conditioned and stored; national repository plans under discussion.",
    "policy_spent_fuel": "No commercial reactors; spent fuel from research reactors stored on-site or returned to supplier.",
    "wmo_name": "National Nuclear Center of Kazakhstan",
    "wmo_responsibilities": "Manages research reactors and waste management facilities.",
    "wmo_ownership": "State",
    "funding_rwm": "Financed by state budget and industry contributions.",
    "funding_sf_hlw": "Same funding mechanisms for any future HLW.",
    "funding_decom": "Decommissioning financed by government and operators.",
    "reactors_in_operation": 0,
    "reactors_under_construction": 0,
    "reactors_decommissioning": 0,
    "reactors_note": "No commercial nuclear reactors; small research reactors at Kurchatov and Alatau."
  },
  {
    "iso3": "MEX",
    "policy_non_nuclear_waste": "LLW and ILW from Laguna Verde stored on-site; national repository under consideration.",
    "policy_disused_sources": "Disused sources returned to supplier or managed by ININ.",
    "policy_nfc_waste": "Operational waste conditioned and stored; HLW policy under development.",
    "policy_spent_fuel": "Spent fuel stored in pools and dry storage at Laguna Verde; future deep repository envisaged.",
    "wmo_name": "CNSNS & CFE",
    "wmo_responsibilities": "CNSNS regulates nuclear safety; CFE manages spent fuel and waste from Laguna Verde.",
    "wmo_ownership": "State",
    "funding_rwm": "Financed by electricity tariffs and government funding.",
    "funding_sf_hlw": "Same funding for spent fuel and HLW.",
    "funding_decom": "Decommissioning financed by operator provisions.",
    "reactors_in_operation": 2,
    "reactors_under_construction": 0,
    "reactors_decommissioning": 0,
    "reactors_note": "Two BWR units at Laguna Verde; no new units under construction."
  },
  {
    "iso3": "PAK",
    "policy_non_nuclear_waste": "LLW and ILW managed and stored by PAEC; disposal facility planned.",
    "policy_disused_sources": "Disused sources returned to supplier or managed by PAEC.",
    "policy_nfc_waste": "Operational waste conditioned and stored; national repository program under study.",
    "policy_spent_fuel": "Spent fuel stored at reactor sites; potential return to supplier for Chinese-designed units.",
    "wmo_name": "PAEC",
    "wmo_responsibilities": "Responsible for all nuclear fuel cycle activities including waste management.",
    "wmo_ownership": "State",
    "funding_rwm": "Financed by government budget and electricity revenues.",
    "funding_sf_hlw": "Same financing for spent fuel and HLW.",
    "funding_decom": "Decommissioning funding mechanisms under development.",
    "reactors_in_operation": 6,
    "reactors_under_construction": 2,
    "reactors_decommissioning": 0,
    "reactors_note": "Six reactors in operation (Chashma and Karachi); two Hualong One units under construction."
  },
  {
    "iso3": "NZL",
    "policy_non_nuclear_waste": "No nuclear power; small amounts of LLW/ILW from medical and industrial uses stored at national facility.",
    "policy_disused_sources": "Disused sources returned to supplier or collected by national radiation laboratory.",
    "policy_nfc_waste": "Not applicable (no nuclear fuel cycle).",
    "policy_spent_fuel": "Not applicable.",
    "wmo_name": "National Radiation Laboratory",
    "wmo_responsibilities": "Manages storage and eventual disposal of small amounts of radioactive waste.",
    "wmo_ownership": "State",
    "funding_rwm": "Financed through government budget.",
    "funding_sf_hlw": "Not applicable.",
    "funding_decom": "Not applicable.",
    "reactors_in_operation": 0,
    "reactors_under_construction": 0,
    "reactors_decommissioning": 0,
    "reactors_note": "New Zealand has no nuclear power reactors; only small waste from medicine and industry."
  },
  {
    "iso3": "MHL",
    "policy_non_nuclear_waste": "Legacy nuclear test waste encapsulated in Runit Dome; no current waste generation.",
    "policy_disused_sources": "Not applicable.",
    "policy_nfc_waste": "Not applicable.",
    "policy_spent_fuel": "Not applicable.",
    "wmo_name": "None",
    "wmo_responsibilities": "No national nuclear program; U.S. DOE oversees Runit Dome.",
    "wmo_ownership": "U.S. Federal oversight",
    "funding_rwm": "U.S. government funded.",
    "funding_sf_hlw": "Not applicable.",
    "funding_decom": "Not applicable.",
    "reactors_in_operation": 0,
    "reactors_under_construction": 0,
    "reactors_decommissioning": 0,
    "reactors_note": "No nuclear reactors; Runit Dome stores waste from U.S. nuclear tests."
  },
  {
    "iso3": "JOR",
    "policy_non_nuclear_waste": "Institutional LLW and ILW stored at national facility in Amman.",
    "policy_disused_sources": "Disused sources returned to supplier or stored at JAEC facilities.",
    "policy_nfc_waste": "No nuclear fuel cycle; research reactor waste managed by national program.",
    "policy_spent_fuel": "No spent fuel.",
    "wmo_name": "JAEC",
    "wmo_responsibilities": "Responsible for waste management and development of nuclear programme.",
    "wmo_ownership": "State",
    "funding_rwm": "Financed by government budget and international assistance.",
    "funding_sf_hlw": "Not applicable.",
    "funding_decom": "Not applicable.",
    "reactors_in_operation": 0,
    "reactors_under_construction": 0,
    "reactors_decommissioning": 0,
    "reactors_note": "Jordan operates a research reactor; no commercial nuclear power program."
  },
  {
    "iso3": "EGY",
    "policy_non_nuclear_waste": "LLW and ILW from research reactors processed at Inshas and stored; future repository considered.",
    "policy_disused_sources": "Disused sources returned to supplier or managed by the Egyptian Atomic Energy Authority.",
    "policy_nfc_waste": "No commercial nuclear fuel cycle yet; planned El Dabaa NPP will produce waste managed by national system.",
    "policy_spent_fuel": "Spent fuel from future El Dabaa plant expected to be stored on-site and possibly returned to supplier.",
    "wmo_name": "EAEA & NPPA",
    "wmo_responsibilities": "EAEA manages research reactor waste; NPPA responsible for waste from El Dabaa NPP.",
    "wmo_ownership": "State",
    "funding_rwm": "Financed by government budget and provisions from NPP operator.",
    "funding_sf_hlw": "Same financing for spent fuel and HLW when El Dabaa operates.",
    "funding_decom": "Decommissioning funds to be established for El Dabaa.",
    "reactors_in_operation": 0,
    "reactors_under_construction": 1,
    "reactors_decommissioning": 0,
    "reactors_note": "El Dabaa NPP (four units) under construction; research reactors at Inshas."
  },
  {
    "iso3": "ARE",
    "policy_non_nuclear_waste": "LLW and ILW conditioned and stored on-site at Barakah; policy for national repository under development.",
    "policy_disused_sources": "Disused sources returned to supplier or managed by ENEC.",
    "policy_nfc_waste": "Operational waste managed by ENEC and Nawah; disposal in national facility planned.",
    "policy_spent_fuel": "Spent fuel stored on-site at Barakah for the lifetime of the plant; long-term disposal solution under study.",
    "wmo_name": "FANR & ENEC",
    "wmo_responsibilities": "FANR regulates nuclear activities; ENEC/Nawah operate Barakah and manage waste.",
    "wmo_ownership": "State and federal regulator",
    "funding_rwm": "Financed by fees charged to operators and government support.",
    "funding_sf_hlw": "Same funding covers future spent fuel and HLW management.",
    "funding_decom": "Decommissioning funds collected during plant operation.",
    "reactors_in_operation": 4,
    "reactors_under_construction": 0,
    "reactors_decommissioning": 0,
    "reactors_note": "Four APR1400 units at Barakah; all expected to be in operation by 2024."
  },
  {
    "iso3": "IRN",
    "policy_non_nuclear_waste": "LLW and ILW from Bushehr and research reactors stored on-site; disposal facility planned.",
    "policy_disused_sources": "Disused sources returned to supplier or managed by AEOI.",
    "policy_nfc_waste": "Operational waste conditioned and stored; high-level waste returned to Russia under fuel contract.",
    "policy_spent_fuel": "Spent fuel from Bushehr returned to Russia after cooling period.",
    "wmo_name": "AEOI",
    "wmo_responsibilities": "Responsible for all nuclear activities including waste management.",
    "wmo_ownership": "State",
    "funding_rwm": "Financed by state budget and power plant revenues.",
    "funding_sf_hlw": "No national HLW management needed due to return-to-supplier contract.",
    "funding_decom": "Decommissioning funded by operator and state.",
    "reactors_in_operation": 1,
    "reactors_under_construction": 4,
    "reactors_decommissioning": 0,
    "reactors_note": "One VVER-1000 unit at Bushehr in operation; additional units under construction."
  },
  {
    "iso3": "IDN",
    "policy_non_nuclear_waste": "LLW and ILW from research reactors stored at BATAN facilities; disposal site planned.",
    "policy_disused_sources": "Disused sources returned to supplier or managed by BATAN.",
    "policy_nfc_waste": "No commercial nuclear fuel cycle; policies under development for future nuclear program.",
    "policy_spent_fuel": "No spent fuel.",
    "wmo_name": "BATAN",
    "wmo_responsibilities": "Responsible for research reactors and radioactive waste management.",
    "wmo_ownership": "State",
    "funding_rwm": "Financed by government budget.",
    "funding_sf_hlw": "Not applicable.",
    "funding_decom": "Not applicable.",
    "reactors_in_operation": 0,
    "reactors_under_construction": 0,
    "reactors_decommissioning": 0,
    "reactors_note": "Indonesia operates research reactors but no nuclear power plants."
  },
  {
    "iso3": "HUN",
    "policy_non_nuclear_waste": "LLW and ILW from Paks NPP disposed at Bátaapáti repository.",
    "policy_disused_sources": "Disused sources returned to supplier or stored by PURAM.",
    "policy_nfc_waste": "Operational waste conditioned and disposed; HLW and spent fuel stored on-site awaiting final solution.",
    "policy_spent_fuel": "Spent fuel from Paks stored in interim dry storage; decision on reprocessing vs direct disposal pending.",
    "wmo_name": "PURAM",
    "wmo_responsibilities": "Responsible for managing and disposing all radioactive waste from Hungary.",
    "wmo_ownership": "State-owned",
    "funding_rwm": "Financed by Nuclear Energy Fund funded by fees on electricity production.",
    "funding_sf_hlw": "Same fund for spent fuel and HLW management.",
    "funding_decom": "Decommissioning financed through the Nuclear Energy Fund.",
    "reactors_in_operation": 4,
    "reactors_under_construction": 0,
    "reactors_decommissioning": 0,
    "reactors_note": "Four VVER-440 units at Paks; lifetime extension underway; new Paks II project planned."
  },
  {
    "iso3": "BGR",
    "policy_non_nuclear_waste": "LLW and ILW from Kozloduy disposed in near-surface repository at Radiana under construction.",
    "policy_disused_sources": "Disused sources returned to supplier or managed by SERAW.",
    "policy_nfc_waste": "Operational waste conditioned and stored; HLW returned to Russia after reprocessing.",
    "policy_spent_fuel": "Spent fuel shipped to Russia for reprocessing under fuel supply contract.",
    "wmo_name": "SERAW",
    "wmo_responsibilities": "Manages radioactive waste from nuclear power and medicine; builds disposal facilities.",
    "wmo_ownership": "State",
    "funding_rwm": "Financed by Nuclear Facilities Decommissioning Fund paid by electricity consumers.",
    "funding_sf_hlw": "Spent fuel management funded by contracts with Russia and national fund.",
    "funding_decom": "Decommissioning financed through decommissioning fund.",
    "reactors_in_operation": 2,
    "reactors_under_construction": 0,
    "reactors_decommissioning": 2,
    "reactors_note": "Two VVER-1000 units at Kozloduy in operation; older units shut down and being decommissioned."
  },
  {
    "iso3": "AUS",
    "policy_non_nuclear_waste": "Institutional radioactive waste stored at ANSTO and state facilities; national disposal facility being developed at Kimba.",
    "policy_disused_sources": "Disused sources returned to supplier or managed by ANSTO.",
    "policy_nfc_waste": "No commercial nuclear fuel cycle; waste from research reactors and industry stored and planned for disposal at National Radioactive Waste Management Facility.",
    "policy_spent_fuel": "No spent fuel (research reactor fuel returned to supplier).",
    "wmo_name": "ARWA",
    "wmo_responsibilities": "Develops and will operate national radioactive waste facility; ANSTO manages existing waste.",
    "wmo_ownership": "State",
    "funding_rwm": "Funded by government and waste producers through service fees.",
    "funding_sf_hlw": "Not applicable (no SF/HLW).",
    "funding_decom": "Decommissioning funded by government.",
    "reactors_in_operation": 0,
    "reactors_under_construction": 0,
    "reactors_decommissioning": 0,
    "reactors_note": "No nuclear power; only research reactor (OPAL) producing low-level waste."
  }
]